In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df=pd.read_csv("F:\\REGex\\PANDAS\\titanic.csv",usecols=['Age','Fare'])

In [3]:
df.head()

    Age     Fare
0  34.5   7.8292
1  47.0   7.0000
2  62.0   9.6875
3  27.0   8.6625
4  22.0  12.2875

In [15]:
df['Age'].fillna(df['Age'].mean(),inplace=True)
df['Fare'].fillna(df['Fare'].mean(),inplace=True)

In [16]:
from sklearn.preprocessing import StandardScaler

In [17]:
sc=StandardScaler()

In [18]:
x_new=sc.fit_transform(df)

In [21]:
from sklearn.decomposition import PCA

In [22]:
pc=PCA(n_components=2)

In [23]:
pc_trf=pc.fit_transform(x_new)

In [24]:
pc_df=pd.DataFrame(pc_trf,columns=['pc1','pc2'])

In [25]:
pc_df

          pc1       pc2
0   -0.115551 -0.589303
1    0.574352 -1.300231
2    1.448923 -2.106657
3   -0.525236 -0.158488
4   -0.759444  0.167636
..        ...       ...
413 -0.349628 -0.349628
414  1.417989  0.439938
415  0.101238 -0.820779
416 -0.349628 -0.349628
417 -0.168225 -0.168225

[418 rows x 2 columns]

In [4]:
df.isnull().sum()

Age     86
Fare     1
dtype: int64

In [5]:
len(df)

418

In [9]:
df["Age"].isnull().sum() / len(df)*100

20.574162679425836

In [11]:
df

      Age      Fare
0    34.5    7.8292
1    47.0    7.0000
2    62.0    9.6875
3    27.0    8.6625
4    22.0   12.2875
..    ...       ...
413   NaN    8.0500
414  39.0  108.9000
415  38.5    7.2500
416   NaN    8.0500
417   NaN   22.3583

[418 rows x 2 columns]

      Age     Fare
0    34.5   7.8292
1    47.0      7.0
2    62.0   9.6875
3    27.0   8.6625
4    22.0  12.2875
..    ...      ...
413   Age     8.05
414  39.0    108.9
415  38.5     7.25
416   Age     8.05
417   Age  22.3583

[418 rows x 2 columns]

In [16]:
df.isnull().mean()*100

Age     20.574163
Fare     0.239234
dtype: float64